#include <stdio.h>
#include <loadcore.h>
#include <modload.h>
#include <stdio.h>
#include <sysclib.h>
#include <thbase.h>
#include <thevent.h>
#include <irx.h>

#include <smapregs.h>
#include <speedregs.h>

#define DEV9_SMAP_ALL_INTR_MASK	(SMAP_INTR_EMAC3|SMAP_INTR_RXEND|SMAP_INTR_TXEND|SMAP_INTR_RXDNV|SMAP_INTR_TXDNV)	/* 0x7C */
#define DEV9_SMAP_INTR_MASK	(SMAP_INTR_EMAC3|SMAP_INTR_RXEND|SMAP_INTR_RXDNV|SMAP_INTR_TXDNV)			/* 0x6C */
#define DEV9_SMAP_INTR_MASK2	(SMAP_INTR_EMAC3|SMAP_INTR_RXEND|SMAP_INTR_RXDNV)					/* 0x68 */

/* Event flag bits */
#define NETDEV_EVENT_START	1
#define NETDEV_EVENT_STOP	2
#define NETDEV_EVENT_INTR	4
#define NETDEV_EVENT_XMIT	8
#define NETDEV_EVENT_LINK_CHECK	0x10

IRX_ID("INET_SMAP_driver", 0x02, 0x19);

extern struct irx_export_table _exp_smap;

/* This seems to be a really huge structure. */
struct SmapDriverData{
	volatile u8 *smap_regbase;	/* 0x00 */
	volatile u8 *emac3_regbase;	/* 0x04 */
	unsigned int TxBufferSpaceAvailable;	/* 0x08 */
	unsigned int NumPacketsInTx;	/* 0x0C */
	unsigned int TxBDIndex;		/* 0x10 */
	unsigned int TxDNVBDIndex;	/* 0x14 */
	unsigned int RxBDIndex;		/* 0x18 */
	sceInetPkt_t *packet;		/* 0x1C */
	int Dev9IntrEventFlag;		/* 0x20 */
	int IntrHandlerThreadID;
	unsigned int SmapDriverStarted;
	unsigned int SmapIsInitialized;
	unsigned int NetDevStopFlag;	/* 0x30 */
	unsigned int EnableLinkCheckTimer;	/* 0x34 */
	unsigned int LinkStatus;		/* 0x38 */
	unsigned int LinkMode;		/* 0x3C */
	iop_sys_clock_t LinkCheckTimer;		/* 0x40 */
	unsigned int unknown7[62];
	sceINetDevOps_t NetDevOps;	/* 0x13C */
};

static struct SmapDriverData SmapDriverData;	/* 0x000032a0 */

static const char VersionString[]="Version 2.25.0";
static unsigned int ThreadPriority=0x28;		/* 0x000031F8 */
static unsigned int ThreadStackSize=0x2000;	/* 0x000031FC */
static unsigned int VerbosityLevel=0;		/* 0x00003200 */
static unsigned int EnableAutoNegotiation=1;	/* 0x00003204 */
static unsigned int EnablePinStrapConfig=0;	/* 0x00003208 */
static unsigned int SmapConfiguration=0x5E0;	/* 0x0000320C */

static unsigned int var_00003280=0;		/* 0x00003280 */
static unsigned int var_00003284=0;		/* 0x00003284 */
static unsigned int var_00003288=0;		/* 0x00003288 */

static unsigned int IntrCounter;		/* 0x00003290 */
static char NetDeviceName[]="Ethernet (Network Adaptor)";	/* 0x00002ea4 */
static char NetDeviceModuleName[]="smap";	/* 0x00003238 */
static char NetDeviceVendorName[]="SCE";	/* 0x00003240 */

extern void *_gp;

/* 0x00001f60 */
static int DisplayBanner(void){
	printf("SMAP (%s)\n", VersionString);
	return 1;
}

/* 0x00000000 */
static void _smap_write_phy(volatile u8 *emac3_regbase, unsigned char address, unsigned short int value){
	unsigned int i, PHYRegisterValue;

	PHYRegisterValue=(address&SMAP_E3_PHY_REG_ADDR_MSK)|SMAP_E3_PHY_WRITE|((SMAP_DsPHYTER_ADDRESS&SMAP_E3_PHY_ADDR_MSK)<<SMAP_E3_PHY_ADDR_BITSFT);
	PHYRegisterValue|=((unsigned int)value)<<SMAP_E3_PHY_DATA_BITSFT;

	i=0;
	SMAP_EMAC3_SET(SMAP_R_EMAC3_STA_CTRL, PHYRegisterValue);
	SMAP_EMAC3_GET(SMAP_R_EMAC3_STA_CTRL);

	for(; !(SMAP_EMAC3_GET(SMAP_R_EMAC3_STA_CTRL)&SMAP_E3_PHY_OP_COMP); i++){
		DelayThread(0x3E8);
		if(i>=0x64) break;
	}

	if(i>=0x64) sceInetPrintf("smap: %s: > %d ms\n", "_smap_write_phy", i);
}

/* 0x000000A0 */
static int _smap_read_phy(volatile u8 *emac3_regbase, unsigned int address){
	unsigned int i, PHYRegisterValue;
	int result;

	PHYRegisterValue=(address&SMAP_E3_PHY_REG_ADDR_MSK)|SMAP_E3_PHY_READ|((SMAP_DsPHYTER_ADDRESS&SMAP_E3_PHY_ADDR_MSK)<<SMAP_E3_PHY_ADDR_BITSFT);

	i=0;
	SMAP_EMAC3_SET(SMAP_R_EMAC3_STA_CTRL, PHYRegisterValue);
	SMAP_EMAC3_GET(SMAP_R_EMAC3_STA_CTRL);

	do{
		if(SMAP_EMAC3_GET(SMAP_R_EMAC3_STA_CTRL)&SMAP_E3_PHY_OP_COMP){
			if(SMAP_EMAC3_GET(SMAP_R_EMAC3_STA_CTRL)&SMAP_E3_PHY_OP_COMP){
				if((result=SMAP_EMAC3_GET(SMAP_R_EMAC3_STA_CTRL))&SMAP_E3_PHY_OP_COMP){
					result>>=SMAP_E3_PHY_DATA_BITSFT;
					break;
				}
			}
		}

		DelayThread(0x3E8);
		i++;
	}while(i<0x64);

	if(i>=0x64){
		sceInetPrintf("smap: %s: > %d ms\n", "_smap_read_phy", i);
		result>>=SMAP_E3_PHY_DATA_BITSFT;
	}

	return result;
}

/* 0x00001f8c */
static int DisplayHelpMessage(void){
	DisplayBanner();

	printf("Usage: smap [<option>] [thpri=<prio>] [thstack=<stack>] [<conf>]\n");
	printf("  <option>:\n");
	printf("    -verbose       display verbose messages\n");
	printf("    -auto          auto nego enable            [default]\n");
	printf("    -no_auto       fixed mode\n");
	printf("    -strap         use pin-strap config\n");
	printf("    -no_strap      do not use pin-strap config [default]\n");

	return 2;
}

static inline void RestartAutoNegotiation(volatile u8 *emac3_regbase){
	if(VerbosityLevel) sceInetPrintf("smap: restarting auto nego (BMCR=0x%x, BMSR=0x%x)\n", _smap_read_phy(emac3_regbase, SMAP_DsPHYTER_BMCR), value);
	_smap_write_phy(emac3_regbase, SMAP_DsPHYTER_BMCR, SMAP_PHY_BMCR_ANEN|SMAP_PHY_BMCR_RSAN);	/* 0x1200 */
}

/* 0x00000998 */
static int InitPHY(struct SmapDriverData *SmapDrivPrivData){
	int i, result;
	unsigned int value, value2, LinkSpeed100M, LinkFDX, FlowControlEnabled, AutoNegoRetries;
	unsigned short int RegDump[6];
	volatile u8 *emac3_regbase;

	LinkSpeed100M=0;
	if(VerbosityLevel!=0) sceInetPrintf("smap: R\n");

	_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR, SMAP_PHY_BMCR_RST);
	for(i=0; _smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR)&SMAP_PHY_BMCR_RST; i++){
		if(i<=0){
			sceInetPrintf("smap: PHY reset error\n");
			return -1;
		}
		if(SmapDrivPrivData->NetDevStopFlag) return 0;

		DelayThread(0x3E8);
	}

	if(!EnableAutoNegotiation){	/* 0x00000a38 */
		if(VerbosityLevel!=0) sceInetPrintf("smap: no auto mode (conf=0x%x)\n", SmapConfiguration);

		LinkSpeed100M=0<(SmapConfiguration&0x180);	/* Toggles between SMAP_PHY_BMCR_10M and SMAP_PHY_BMCR_100M. */
		value=LinkSpeed100M<<13;
		if(SmapConfiguration&0x140) value|=SMAP_PHY_BMCR_DUPM;
		_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR, value);

WaitLink:
		sceInetPrintf("smap: Waiting Valid Link for %dMbps\n", LinkSpeed100M?100:10);

		i=0;
		while(1){
			DelayThread(0x30d40);
			if(SmapDrivPrivData->NetDevStopFlag) return 0;
			i++;
			if(_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMSR)&SMAP_PHY_BMSR_LINK) break;
			if(i>=5) SmapDrivPrivData->LinkStatus=0;
		}

		SmapDrivPrivData->LinkStatus=1;
	}
	else{
		if(!EnablePinStrapConfig){	/* 0x00000af0 */
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR, 0);
			value=_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMSR)&0xFFFF;
			if(!(value&0x4000)) SmapConfiguration=SmapConfiguration&0xFFFFFEFF;	/* 100Base-TX FDX */
			if(!(value&0x2000)) SmapConfiguration=SmapConfiguration&0xFFFFFF7F;	/* 100Base-TX HDX */
			if(!(value&0x1000)) SmapConfiguration=SmapConfiguration&0xFFFFFFBF;	/* 10Base-TX FDX */
			if(!(value&0x0800)) SmapConfiguration=SmapConfiguration&0xFFFFFFDF;	/* 10Base-TX HDX */

			sceInetPrintf("smap: no strap mode (conf=0x%x->0x%x, bmsr=0x%x)\n", SmapConfiguration, value);

			value=_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_ANAR)&0xFFFF;
			value=(SmapConfiguration&0x5E0)|(value&0x1F);
			sceInetPrintf("smap: anar=0x%x->0x%x\n", value);
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_ANAR, value);
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR, SMAP_PHY_BMCR_ANEN|SMAP_PHY_BMCR_RSAN);	/* 0x1200 */
		}
		else{	/* 0x00000c10 */
			if(!(_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR)&SMAP_PHY_BMCR_ANEN)){
				goto WaitLink;
			}
		}

		/* 0x00000c10 */
		sceInetPrintf("smap: auto mode (BMCR=0x%x ANAR=0x%x)\n", _smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR)&0xFFFF, _smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_ANAR)&0xFFFF);

RepeatAutoNegoProcess:
		for(AutoNegoRetries=0; AutoNegoRetries<3; AutoNegoRetries++){
			for(i=0; i<3; i++){
				DelayThread(0xf4240);
				if(SmapDrivPrivData->NetDevStopFlag) return 0;
			}

			value=_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMSR)&0xFFFF;
			if((value&(SMAP_PHY_BMSR_ANCP|0x10))==SMAP_PHY_BMSR_ANCP){	/* 0x30: SMAP_PHY_BMSR_ANCP and Remote fault. */
				/* This seems to be checking for the link-up status. */
				for(i=0; !(_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMSR)&SMAP_PHY_BMSR_LINK); i++){
					DelayThread(0x30d40);
					if(SmapDrivPrivData->NetDevStopFlag) return 0;
					if(i>=0x14) break;
				}

				if(i<0x14){
					/* Auto negotiaton completed successfully. */
					SmapDrivPrivData->LinkStatus=1;
					break;
				}
				else RestartAutoNegotiation(SmapDrivPrivData->emac3_regbase);
			}
			else RestartAutoNegotiation(SmapDrivPrivData->emac3_regbase);
		}

		/* 0x00000d38: If automatic negotiation fails, manually figure out which speed and duplex mode to use. */
		if(AutoNegoRetries>=3){
			if(VerbosityLevel) sceInetPrintf("smap: waiting valid link for 100Mbps Half-Duplex\n");

			_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR, SMAP_PHY_BMCR_100M);
			DelayThread(0xf4240);
			if(SmapDrivPrivData->NetDevStopFlag) return 0;

			for(i=0; !(_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMSR)&SMAP_PHY_BMSR_LINK); i++){
				DelayThread(0x186a0);
				if(SmapDrivPrivData->NetDevStopFlag) return 0;
				if(i>=0x1E) break;
			}

			if(i>=0x1E){
				if(VerbosityLevel) sceInetPrintf("smap: waiting valid link for 10Mbps Half-Duplex\n");

				_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR, 0);
				DelayThread(0xf4240);
				if(SmapDrivPrivData->NetDevStopFlag) return 0;

				for(i=0; !(_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMSR)&SMAP_PHY_BMSR_LINK); i++){
					DelayThread(0x186a0);
					if(SmapDrivPrivData->NetDevStopFlag) return 0;
					if(i>=0x1E) break;
				}

				if(i>=0x1E) goto RepeatAutoNegoProcess;
				else SmapDrivPrivData->LinkStatus=1;
			}
			else SmapDrivPrivData->LinkStatus=1;
		}
	}

	/* 0x00000e54 */
	for(i=0; i<6; i++) RegDump[i]=_smap_read_phy(SmapDrivPrivData->emac3_regbase, i);

	if(VerbosityLevel) sceInetPrintf("smap: PHY: %04x %04x %04x %04x %04x %04x\n", RegDump[SMAP_DsPHYTER_BMCR], RegDump[SMAP_DsPHYTER_BMSR], RegDump[SMAP_DsPHYTER_PHYIDR1], RegDump[SMAP_DsPHYTER_PHYIDR2], RegDump[SMAP_DsPHYTER_ANAR], RegDump[SMAP_DsPHYTER_ANLPAR]);

	/* if SMAP_DsPHYTER_PHYIDR1 == SMAP_PHY_IDR1_VAL && SMAP_DsPHYTER_PHYIDR2 == SMAP_PHY_IDR2_VAL */
	if(RegDump[SMAP_DsPHYTER_PHYIDR1]==SMAP_PHY_IDR1_VAL && (RegDump[SMAP_DsPHYTER_PHYIDR2]&SMAP_PHY_IDR2_MSK)==SMAP_PHY_IDR2_VAL){
		if(EnableAutoNegotiation){
			_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_FCSCR);
			_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_RECR);
			DelayThread(0x7a120);
			value=_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_FCSCR);
			value2=_smap_read_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_RECR);
			if((value2&0xFFFF)!=0 || (value&0xFFFF)>=0x11){
				if(VerbosityLevel) sceInetPrintf("smap: FCSCR=%d RECR=%d\n", value&0xFFFF, value2&0xFFFF);
				_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_BMCR, 0);
				goto WaitLink;
			}
		}

		/* 0x00000f7c */
		sceInetPrintf("smap: PHY chip: DP83846A%d\n", RegDump[SMAP_DsPHYTER_PHYIDR2]&SMAP_PHY_IDR2_REV_MSK);

		if(!EnableAutoNegotiation){
			if(RegDump[SMAP_DsPHYTER_BMCR]&(SMAP_PHY_BMCR_DUPM|SMAP_PHY_BMCR_100M)){	/* if SMAP_DsPHYTER_BMCR&0x2100 */
				_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_10BTSCR, 0x104);
			}
		}
		else{
			if((RegDump[SMAP_DsPHYTER_ANAR]&0x1E0)==0x20){	/* SMAP_DsPHYTER_ANAR */
				_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_10BTSCR, 0x104);
			}
		}

		if((RegDump[SMAP_DsPHYTER_PHYIDR2]&SMAP_PHY_IDR2_REV_MSK)==0){	/* SMAP_DsPHYTER_PHYIDR2 */
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, 0x13, 1);
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, SMAP_DsPHYTER_PHYCTRL, 0x1819);
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, 0x1F, 0);
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, 0x1D, 0x5040);
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, 0x1E, 0x8C);
			_smap_write_phy(SmapDrivPrivData->emac3_regbase, 0x13, 0);
		}
	}
	/* 0x00001048 */
	FlowControlEnabled=0;
	if(RegDump[SMAP_DsPHYTER_BMCR]&SMAP_PHY_BMCR_ANEN){	/* if SMAP_DsPHYTER_BMCR & SMAP_PHY_BMCR_ANEN */
		value=RegDump[SMAP_DsPHYTER_ANAR]&RegDump[SMAP_DsPHYTER_ANLPAR];
		LinkSpeed100M=0<(value&0x180);
		LinkFDX=0<(value&0x140);
		if(LinkFDX) FlowControlEnabled=0<(value&0x400);
	}
	else{	/* 0x0000108c */
		LinkSpeed100M=RegDump[SMAP_DsPHYTER_BMCR]>>13&1;
		LinkFDX=RegDump[SMAP_DsPHYTER_BMCR]>>8&1;
		FlowControlEnabled=SmapConfiguration>>10&1;
	}

	/* 0x000010ac */
	if(LinkSpeed100M) result=LinkFDX?8:4;
	else result=LinkFDX?2:1;

	/* 0x000010f4 */
	SmapDrivPrivData->LinkMode=result;
	if(FlowControlEnabled) SmapDrivPrivData->LinkMode|=0x40;

	/* 0x0000110c */
	sceInetPrintf("smap: %s %s Duplex Mode %s Flow Control\n", LinkSpeed100M?"100BaseTX":"10BaseT", LinkFDX?"Full":"Half", FlowControlEnabled?"with":"without");

	/* 0x0000114c */
	emac3_regbase=SmapDrivPrivData->emac3_regbase;
	value=SMAP_EMAC3_GET(SMAP_R_EMAC3_MODE1)&0x67FFFFFF;
	if(LinkFDX) value|=SMAP_E3_FDX_ENABLE;	/* 0x80000000 */
	if(FlowControlEnabled) value|=SMAP_E3_FLOWCTRL_ENABLE|SMAP_E3_ALLOW_PF;	/* 0x18000000 */
	SMAP_EMAC3_SET(SMAP_R_EMAC3_MODE1, value);

	return 0;
}

/* 0x00001210 */
static unsigned int LinkCheckTimerCB(struct SmapDriverData *SmapDrivPrivData){
	iSetEventFlag(SmapDrivPrivData->Dev9IntrEventFlag, NETDEV_EVENT_LINK_CHECK);
	return SmapDrivPrivData->LinkCheckTimer.lo;
}

/* 0x00000584 */
static int HandleTxDNVIntr(struct SmapDriverData *SmapDrivPrivData){
	int result;
	volatile u8 *smap_regbase;
	unsigned int RegisterOffset, i;
	USE_SMAP_TX_BD;
	unsigned short int ctrl_stat;

	smap_regbase=SmapDrivPrivData->smap_regbase;
	result=0;
	if(SmapDrivPrivData->NumPacketsInTx>0){
		do{
			if(!((ctrl_stat=tx_bd[SmapDrivPrivData->TxDNVBDIndex&(SMAP_BD_MAX_ENTRY-1)].ctrl_stat)&SMAP_BD_TX_READY)){	/* 0x8000 */
				tx_bd[SmapDrivPrivData->TxDNVBDIndex&(SMAP_BD_MAX_ENTRY-1)].pointer;	/* Seems to get loaded, but never used? */
				if(ctrl_stat&(SMAP_BD_TX_UNDERRUN|SMAP_BD_TX_LCOLL|SMAP_BD_TX_ECOLL|SMAP_BD_TX_EDEFER|SMAP_BD_TX_LOSSCR)){	/* 0xF2 */
					for(i=0; i<16; i++){
						if(ctrl_stat>>i&1) SmapDrivPrivData->unknown7[17]++;	/* 0x000005E0: (offset*4+0x88)++ */
					}

					/* 0x00000614 */
					SmapDrivPrivData->unknown7[38]++;	/* Offset 0xDC */
					if(ctrl_stat&SMAP_BD_TX_LOSSCR){	/* 0x80 */
						SmapDrivPrivData->unknown7[58]++;	/* Offset0x12C */
					}
					if(ctrl_stat&SMAP_BD_TX_EDEFER){	/* 0x40 */
						SmapDrivPrivData->unknown7[61]++;	/* Offset0x138 */
					}
					/* 0x00000660 */
					if(ctrl_stat&(SMAP_BD_TX_SCOLL|SMAP_BD_TX_MCOLL|SMAP_BD_TX_LCOLL|SMAP_BD_TX_ECOLL)){	/* 0x3C */
						SmapDrivPrivData->unknown7[50]++;	/* Offset0x10C */
					}
					if(ctrl_stat&SMAP_BD_TX_UNDERRUN){	/* 0x2 */
						SmapDrivPrivData->unknown7[59]++;	/* Offset0x130 */
					}
				}
			}
			else return result;

			/* 0x00000694 */
			result++;
			SmapDrivPrivData->TxBufferSpaceAvailable+=(tx_bd[SmapDrivPrivData->TxDNVBDIndex&(SMAP_BD_MAX_ENTRY-1)].length+3)&~3;
			SmapDrivPrivData->TxDNVBDIndex++;
			SmapDrivPrivData->NumPacketsInTx--;
		}while(SmapDrivPrivData->NumPacketsInTx>0);
	}

	return result;
}

/* 0x00000214 */
static int SmapDmaTransfer(volatile u8 *smap_regbase, void *buffer, unsigned int size, int direction){
	unsigned short int NumBlocks;
	int result;

	if((NumBlocks=size>>7)<=0){
		if(dev9DmaTransfer(1, buffer, size<<16|0x20, direction)>=0){
			result=NumBlocks<<7;
		}
		else result=0;
	}
	else result=0;

	return result;
}

/* 0x00000254 */
static int HandleRxIntr(struct SmapDriverData *SmapDrivPrivData){
	USE_SMAP_REGS;
	USE_SMAP_RX_BD;
	int NumPacketsReceived, result;
	sceInetPkt_t *packet;
	unsigned int PacketLength, i, PacketBDPointer;
	volatile smap_bd_t *PktBdPtr;

